<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"4192f1366d40ad91c1f64fb1dcba131a7248a5744e3e879cb896fa6f2d0b917f","plan_job_ref":"Job Create terraform plan #71 at https://github.com/Zeichen-gegen-Mobbing/Projectcoordinator/actions/runs/17129272489","plan_out_hash":"a9d1215daa106a9ff460e3c3d7aff8f53e02f54827117e61071ff4aa142461c8","plan_hash":"ceb4a9fe45d221b1d88100ff6422452945305c6a587650c19f5e164c89d482b4","plan_text_format":"diff","version":"2.2.2"} -->
OpenTofu plan in __infrastructure__
With backend config: `resource_group_name=rg-ProjectCoordinator-Deploy-prd
storage_account_name=stprdtfprojectcoordinato
container_name=tfstate`<details open><summary>With variables</summary>

```hcl
cosmos_connection_string   = (sensitive value)
environment                = "prd"
open_route_service_api_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # azurerm_cosmosdb_sql_container.places is tainted, so it must be replaced
-/+ resource "azurerm_cosmosdb_sql_container" "places" {
!~      id                  = "*******************************************************************************************************************************************************************************************************************************" -> (known after apply)
        name                = "Projectcoordinator-Places"
!~      throughput          = 0 -> (known after apply)
#        (5 unchanged attributes hidden)

!~      conflict_resolution_policy {
+           account_name           = (known after apply)
+           analytical_storage_ttl = (known after apply)
+           database_name          = (known after apply)
+           default_ttl            = (known after apply)
+           id                     = (known after apply)
+           name                   = (known after apply)
+           partition_key_kind     = (known after apply)
+           partition_key_paths    = (known after apply)
+           partition_key_version  = (known after apply)
+           resource_group_name    = (known after apply)
+           throughput             = (known after apply)
        } -> (known after apply)

!~      indexing_policy {
+           account_name           = (known after apply)
+           analytical_storage_ttl = (known after apply)
+           database_name          = (known after apply)
+           default_ttl            = (known after apply)
+           id                     = (known after apply)
+           name                   = (known after apply)
+           partition_key_kind     = (known after apply)
+           partition_key_paths    = (known after apply)
+           partition_key_version  = (known after apply)
+           resource_group_name    = (known after apply)
+           throughput             = (known after apply)
        } -> (known after apply)
    }

  # azurerm_static_web_app.this will be updated in-place
!~  resource "azurerm_static_web_app" "this" {
!~      app_settings                       = {
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change.
!~          "Cosmos__ConnectionString" = (sensitive value)
+           "Cosmos__ContainerId"      = "Projectcoordinator-Places"
+           "Cosmos__DatabaseId"       = "cosql-shared-free-zgm"
!~          "OpenRouteService__ApiKey" = (sensitive value)
        }
        id                                 = "/subscriptions/36fd3843-f200-408f-a432-9bd04c5af9be/resourceGroups/rg-ProjectCoordinator-prd/providers/Microsoft.Web/staticSites/stapp-ProjectCoordinator-prd"
        name                               = "stapp-ProjectCoordinator-prd"
-       repository_branch                  = "main" -> null
-       repository_url                     = "https://github.com/Zeichen-gegen-Mobbing/Projectcoordinator" -> null
        tags                               = {}
#        (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #71](https://github.com/Zeichen-gegen-Mobbing/Projectcoordinator/actions/runs/17129272489)